qmk/ChibiOS/os/hal/ports/STM32/STM32U3xx_TEST/clocktree.h
/*
    ChibiOS - Copyright (C) 2006-2026 Giovanni Di Sirio.

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    clocktree.h
 * @brief   Generated clock tree description header.
 *
 * @addtogroup CLOCKTREE
 * @{
 */
#ifndef CLOCKTREE_H
#define CLOCKTREE_H

/*===========================================================================*/
/* Driver constants.                                                         */
/*===========================================================================*/

/**
 * @name    Dynamic clock point indexes and names
 * @{
 */
#define CLK_HSI16               0U
#define CLK_HSI48               1U
#define CLK_HSE                 2U
#define CLK_MSIS                3U
#define CLK_MSIK                4U
#define CLK_SYSCLK              5U
#define CLK_HCLK                6U
#define CLK_PCLK1               7U
#define CLK_PCLK1TIM            8U
#define CLK_PCLK2               9U
#define CLK_PCLK2TIM            10U
#define CLK_PCLK3               11U
#define CLK_MCO1                12U
#define CLK_MCO2                13U
#define CLK_ARRAY_SIZE          14U

#define CLK_POINT_NAMES                                                     \
  {                                                                         \
    "HSI16",                                                                \
    "HSI48",                                                                \
    "HSE",                                                                  \
    "MSIS",                                                                 \
    "MSIK",                                                                 \
    "SYSCLK",                                                               \
    "HCLK",                                                                 \
    "PCLK1",                                                                \
    "PCLK1TIM",                                                             \
    "PCLK2",                                                                \
    "PCLK2TIM",                                                             \
    "PCLK3",                                                                \
    "MCO1",                                                                 \
    "MCO2"                                                                  \
  }
/** @} */

/**
 * @name    Generated mux selector constants
 * @{
 */
#define RCC_CFGR1_SW_MSIS                   ((0U) << 0U)
#define RCC_CFGR1_SW_HSI16                  ((1U) << 0U)
#define RCC_CFGR1_SW_HSE                    ((2U) << 0U)

#define RCC_CFGR1_MCO1SEL_OFF               ((0U) << 24U)
#define RCC_CFGR1_MCO1SEL_SYSCLK            ((1U) << 24U)
#define RCC_CFGR1_MCO1SEL_MSIS              ((2U) << 24U)
#define RCC_CFGR1_MCO1SEL_HSI16             ((3U) << 24U)
#define RCC_CFGR1_MCO1SEL_HSE               ((4U) << 24U)
#define RCC_CFGR1_MCO1SEL_LSI               ((5U) << 24U)
#define RCC_CFGR1_MCO1SEL_LSE               ((6U) << 24U)
#define RCC_CFGR1_MCO1SEL_HSI48             ((7U) << 24U)
#define RCC_CFGR1_MCO1SEL_MSIK              ((8U) << 24U)

#define RCC_CFGR1_MCO2SEL_OFF               ((0U) << 16U)
#define RCC_CFGR1_MCO2SEL_SYSCLK            ((1U) << 16U)
#define RCC_CFGR1_MCO2SEL_MSIS              ((2U) << 16U)
#define RCC_CFGR1_MCO2SEL_HSI16             ((3U) << 16U)
#define RCC_CFGR1_MCO2SEL_HSE               ((4U) << 16U)
#define RCC_CFGR1_MCO2SEL_LSI               ((5U) << 16U)
#define RCC_CFGR1_MCO2SEL_LSE               ((6U) << 16U)
#define RCC_CFGR1_MCO2SEL_HSI48             ((7U) << 16U)
#define RCC_CFGR1_MCO2SEL_MSIK              ((8U) << 16U)

#define RCC_BDCR_RTCSEL_NOCLOCK             ((0U) << 8U)
#define RCC_BDCR_RTCSEL_LSE                 ((1U) << 8U)
#define RCC_BDCR_RTCSEL_LSI                 ((2U) << 8U)
#define RCC_BDCR_RTCSEL_HSEDIV              ((3U) << 8U)

#define RCC_BDCR_LSCOSEL_NOCLOCK            ((0U) << 24U)
#define RCC_BDCR_LSCOSEL_LSI                ((1U) << 24U)
#define RCC_BDCR_LSCOSEL_LSE                ((3U) << 24U)

#define RCC_CCIPR1_USART1SEL_PCLK2          ((0U) << 0U)
#define RCC_CCIPR1_USART1SEL_HSI16          ((1U) << 0U)

#define RCC_CCIPR1_USART3SEL_PCLK1          ((0U) << 2U)
#define RCC_CCIPR1_USART3SEL_HSI16          ((1U) << 2U)

#define RCC_CCIPR1_UART4SEL_PCLK1           ((0U) << 4U)
#define RCC_CCIPR1_UART4SEL_HSI16           ((1U) << 4U)

#define RCC_CCIPR1_UART5SEL_PCLK1           ((0U) << 6U)
#define RCC_CCIPR1_UART5SEL_HSI16           ((1U) << 6U)

#define RCC_CCIPR3_LPUART1SEL_PCLK3         ((0U) << 0U)
#define RCC_CCIPR3_LPUART1SEL_HSI16         ((1U) << 0U)
#define RCC_CCIPR3_LPUART1SEL_LSE           ((2U) << 0U)
#define RCC_CCIPR3_LPUART1SEL_MSIK          ((3U) << 0U)

#define RCC_CCIPR3_LPTIM1SEL_MSIK           ((0U) << 10U)
#define RCC_CCIPR3_LPTIM1SEL_LSI            ((1U) << 10U)
#define RCC_CCIPR3_LPTIM1SEL_HSI16          ((2U) << 10U)
#define RCC_CCIPR3_LPTIM1SEL_LSE            ((3U) << 10U)

#define RCC_CCIPR1_LPTIM2SEL_PCLK1          ((0U) << 18U)
#define RCC_CCIPR1_LPTIM2SEL_LSI            ((1U) << 18U)
#define RCC_CCIPR1_LPTIM2SEL_HSI16          ((2U) << 18U)
#define RCC_CCIPR1_LPTIM2SEL_LSE            ((3U) << 18U)

#define RCC_CCIPR3_LPTIM34SEL_MSIK          ((0U) << 8U)
#define RCC_CCIPR3_LPTIM34SEL_LSI           ((1U) << 8U)
#define RCC_CCIPR3_LPTIM34SEL_HSI16         ((2U) << 8U)
#define RCC_CCIPR3_LPTIM34SEL_LSE           ((3U) << 8U)

#define RCC_CCIPR1_SPI1SEL_PCLK2            ((0U) << 20U)
#define RCC_CCIPR1_SPI1SEL_MSIK             ((1U) << 20U)

#define RCC_CCIPR1_SPI2SEL_PCLK1            ((0U) << 16U)
#define RCC_CCIPR1_SPI2SEL_MSIK             ((1U) << 16U)

#define RCC_CCIPR2_SPI3SEL_PCLK1            ((0U) << 3U)
#define RCC_CCIPR2_SPI3SEL_MSIK             ((1U) << 3U)

