qmk/ChibiOS/os/hal/ports/STM32/STM32U3xx_TEST/clocktree.h
#define RCC_CCIPR2_OCTOSPISEL_SYSCLK        ((0U) << 20U)
#define RCC_CCIPR2_OCTOSPISEL_MSIK          ((1U) << 20U)

#define RCC_CCIPR1_SYSTICKSEL_HCLKDIV8      ((0U) << 22U)
#define RCC_CCIPR1_SYSTICKSEL_LSI           ((1U) << 22U)
#define RCC_CCIPR1_SYSTICKSEL_LSE           ((2U) << 22U)

#define RCC_CCIPR1_ICLKSEL_HSI48            ((0U) << 26U)
#define RCC_CCIPR1_ICLKSEL_MSIK             ((1U) << 26U)
#define RCC_CCIPR1_ICLKSEL_HSE              ((2U) << 26U)
#define RCC_CCIPR1_ICLKSEL_SYSCLK           ((3U) << 26U)

#define RCC_CCIPR1_USB1SEL_ICLK             ((0U) << 28U)
#define RCC_CCIPR1_USB1SEL_ICLKDIV2         ((1U) << 28U)

#define RCC_CCIPR1_I2C1SEL_PCLK1            ((0U) << 10U)
#define RCC_CCIPR1_I2C1SEL_MSIK             ((1U) << 10U)

#define RCC_CCIPR1_I2C2SEL_PCLK1            ((0U) << 12U)
#define RCC_CCIPR1_I2C2SEL_MSIK             ((1U) << 12U)

#define RCC_CCIPR3_I2C3SEL_PCLK3            ((0U) << 6U)
#define RCC_CCIPR3_I2C3SEL_MSIK             ((1U) << 6U)

#define RCC_CCIPR1_I3C1SEL_PCLK1            ((0U) << 8U)
#define RCC_CCIPR1_I3C1SEL_MSIK             ((1U) << 8U)

#define RCC_CCIPR1_I3C2SEL_PCLK2            ((0U) << 14U)
#define RCC_CCIPR1_I3C2SEL_MSIK             ((1U) << 14U)

#define RCC_CCIPR2_ADCDACSEL_HCLK           ((0U) << 16U)
#define RCC_CCIPR2_ADCDACSEL_HSE            ((1U) << 16U)
#define RCC_CCIPR2_ADCDACSEL_MSIK           ((2U) << 16U)

#define RCC_CCIPR2_DAC1SHSEL_LSE            ((0U) << 19U)
#define RCC_CCIPR2_DAC1SHSEL_LSI            ((1U) << 19U)
#define RCC_CCIPR2_DAC1SHSEL_IGNORE         0xFFFFFFFFU

#define RCC_CCIPR2_RNGSEL_HSI48             ((0U) << 11U)
#define RCC_CCIPR2_RNGSEL_MSIK              ((1U) << 11U)
#define RCC_CCIPR2_RNGSEL_IGNORE            0xFFFFFFFFU

#define RCC_CCIPR1_FDCAN1SEL_SYSCLK         ((0U) << 24U)
#define RCC_CCIPR1_FDCAN1SEL_MSIK           ((1U) << 24U)
#define RCC_CCIPR1_FDCAN1SEL_IGNORE         0xFFFFFFFFU

#define RCC_CCIPR2_SAI1SEL_MSIK             ((0U) << 5U)
#define RCC_CCIPR2_SAI1SEL_AUDIOCLK         ((1U) << 5U)
#define RCC_CCIPR2_SAI1SEL_HSE              ((2U) << 5U)

#define RCC_CCIPR2_ADF1SEL_HCLK             ((0U) << 0U)
#define RCC_CCIPR2_ADF1SEL_AUDIOCLK         ((1U) << 0U)
#define RCC_CCIPR2_ADF1SEL_HSE              ((2U) << 0U)
#define RCC_CCIPR2_ADF1SEL_SAI1             ((3U) << 0U)
/** @} */

/**
 * @name    Generated scaler selector constants
 * @{
 */
#define RCC_CFGR2_HPRE_DIV1                 ((0U) << 0U)
#define RCC_CFGR2_HPRE_DIV2                 ((8U) << 0U)
#define RCC_CFGR2_HPRE_DIV4                 ((9U) << 0U)
#define RCC_CFGR2_HPRE_DIV8                 ((10U) << 0U)
#define RCC_CFGR2_HPRE_DIV16                ((11U) << 0U)
#define RCC_CFGR2_HPRE_DIV64                ((12U) << 0U)
#define RCC_CFGR2_HPRE_DIV128               ((13U) << 0U)
#define RCC_CFGR2_HPRE_DIV256               ((14U) << 0U)
#define RCC_CFGR2_HPRE_DIV512               ((15U) << 0U)

#define RCC_CFGR2_PPRE1_DIV1                ((0U) << 4U)
#define RCC_CFGR2_PPRE1_DIV2                ((4U) << 4U)
#define RCC_CFGR2_PPRE1_DIV4                ((5U) << 4U)
#define RCC_CFGR2_PPRE1_DIV8                ((6U) << 4U)
#define RCC_CFGR2_PPRE1_DIV16               ((7U) << 4U)

#define RCC_CFGR2_PPRE2_DIV1                ((0U) << 8U)
#define RCC_CFGR2_PPRE2_DIV2                ((4U) << 8U)
#define RCC_CFGR2_PPRE2_DIV4                ((5U) << 8U)
#define RCC_CFGR2_PPRE2_DIV8                ((6U) << 8U)
#define RCC_CFGR2_PPRE2_DIV16               ((7U) << 8U)

#define RCC_CFGR3_PPRE3_DIV1                ((0U) << 4U)
#define RCC_CFGR3_PPRE3_DIV2                ((4U) << 4U)
#define RCC_CFGR3_PPRE3_DIV4                ((5U) << 4U)
#define RCC_CFGR3_PPRE3_DIV8                ((6U) << 4U)
#define RCC_CFGR3_PPRE3_DIV16               ((7U) << 4U)

#define RCC_CFGR1_MCO1PRE_DIV1              ((0U) << 28U)
#define RCC_CFGR1_MCO1PRE_DIV2              ((1U) << 28U)
#define RCC_CFGR1_MCO1PRE_DIV4              ((2U) << 28U)
#define RCC_CFGR1_MCO1PRE_DIV8              ((3U) << 28U)
#define RCC_CFGR1_MCO1PRE_DIV16             ((4U) << 28U)
#define RCC_CFGR1_MCO1PRE_DIV32             ((5U) << 28U)
#define RCC_CFGR1_MCO1PRE_DIV64             ((6U) << 28U)
#define RCC_CFGR1_MCO1PRE_DIV128            ((7U) << 28U)

#define RCC_CFGR1_MCO2PRE_DIV1              ((0U) << 20U)
#define RCC_CFGR1_MCO2PRE_DIV2              ((1U) << 20U)
#define RCC_CFGR1_MCO2PRE_DIV4              ((2U) << 20U)
#define RCC_CFGR1_MCO2PRE_DIV8              ((3U) << 20U)
#define RCC_CFGR1_MCO2PRE_DIV16             ((4U) << 20U)
#define RCC_CFGR1_MCO2PRE_DIV32             ((5U) << 20U)
#define RCC_CFGR1_MCO2PRE_DIV64             ((6U) << 20U)
#define RCC_CFGR1_MCO2PRE_DIV128            ((7U) << 20U)

#define RCC_CCIPR2_ADCDACPRE_ICLK           ((0U) << 12U)
#define RCC_CCIPR2_ADCDACPRE_ICLKDIV2       ((1U) << 12U)
#define RCC_CCIPR2_ADCDACPRE_ICLKDIV4       ((8U) << 12U)
#define RCC_CCIPR2_ADCDACPRE_ICLKDIV8       ((9U) << 12U)
#define RCC_CCIPR2_ADCDACPRE_ICLKDIV16      ((10U) << 12U)
#define RCC_CCIPR2_ADCDACPRE_ICLKDIV32      ((11U) << 12U)
#define RCC_CCIPR2_ADCDACPRE_ICLKDIV64      ((12U) << 12U)
#define RCC_CCIPR2_ADCDACPRE_ICLKDIV128     ((13U) << 12U)
#define RCC_CCIPR2_ADCDACPRE_ICLKDIV256     ((14U) << 12U)
#define RCC_CCIPR2_ADCDACPRE_ICLKDIV512     ((15U) << 12U)
/** @} */

/*===========================================================================*/
/* Driver pre-compile time settings.                                         */
/*===========================================================================*/

/**
 * @name    Clock tree configurations
 * @{
 */
/**
 * @brief   Enables dynamic clock handling.
 */
#if !defined(STM32_CFG_CLOCK_DYNAMIC) || defined(__DOXYGEN__)
  #define STM32_CFG_CLOCK_DYNAMIC           FALSE
#endif

/**
 * @brief   Selects the core voltage scaling range.
 */
#if !defined(STM32_CFG_PWR_VOSR) || defined(__DOXYGEN__)
  #define STM32_CFG_PWR_VOSR                PWR_VOSR_RANGE1
#endif

/**
 * @brief   Selects the MSIRC0 operating mode.
 */
#if !defined(STM32_CFG_MSIRC0_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_MSIRC0_MODE             RCC_MSIRC0_PLL_LSE
#endif

/**
 * @brief   Selects the MSIRC1 operating mode.
 */
#if !defined(STM32_CFG_MSIRC1_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_MSIRC1_MODE             RCC_MSIRC1_FREE
#endif

/**
 * @brief   Selects the MSIRC1 PLL correction factor.
 */
#if !defined(STM32_CFG_MSIPLL1N_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_MSIPLL1N_VALUE          0
#endif

/**
 * @brief   Selects the source and divide factor for MSIS.
 */
#if !defined(STM32_CFG_MSIS_SRCDIV) || defined(__DOXYGEN__)
  #define STM32_CFG_MSIS_SRCDIV             RCC_ICSCR1_MSIS_IRC0_DIV1
#endif

/**
 * @brief   Selects the source and divide factor for MSIK.
 */
#if !defined(STM32_CFG_MSIK_SRCDIV) || defined(__DOXYGEN__)
  #define STM32_CFG_MSIK_SRCDIV             RCC_ICSCR1_MSIK_IRC0_DIV1
#endif

/**
 * @brief   Selects the system clock source after STOP mode.
 */
#if !defined(STM32_CFG_STOPWUCK) || defined(__DOXYGEN__)
  #define STM32_CFG_STOPWUCK                RCC_CFGR1_STOPWUCK_MSIS
#endif

/**
 * @brief   Selects the kernel clock source after STOP mode.
 */
#if !defined(STM32_CFG_STOPKERWUCK) || defined(__DOXYGEN__)
  #define STM32_CFG_STOPKERWUCK             RCC_CFGR1_STOPKERWUCK_MSIK
#endif

/**
 * @brief   Selects the MSI bias mode.
 */
#if !defined(STM32_CFG_MSIBIAS) || defined(__DOXYGEN__)
  #define STM32_CFG_MSIBIAS                 RCC_ICSCR1_MSIBIAS_CONTINUOUS
#endif

/**
 * @brief   Selects the timer internal capture clock sources.
 */
#if !defined(STM32_CFG_TIMICSEL) || defined(__DOXYGEN__)
  #define STM32_CFG_TIMICSEL                RCC_CCIPR1_TIMICSEL_NOCLOCK
#endif

/**
 * @brief   Enables demand for the DAC1 sample-and-hold clock.
 */
#if !defined(STM32_CFG_DAC1SH_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_DAC1SH_REQUIRED         FALSE
#endif

/**
 * @brief   Enables demand for the LPTIM1 clock.
 */
#if !defined(STM32_CFG_LPTIM1_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_LPTIM1_REQUIRED         FALSE
#endif

/**
 * @brief   Enables demand for the LPTIM2 clock.
 */
#if !defined(STM32_CFG_LPTIM2_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_LPTIM2_REQUIRED         FALSE
#endif

/**
 * @brief   Enables demand for the LPTIM3 and LPTIM4 clocks.
 */
#if !defined(STM32_CFG_LPTIM34_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_LPTIM34_REQUIRED        FALSE
#endif

/**
 * @brief   Enables demand for the OCTOSPI clock.
 */
#if !defined(STM32_CFG_OCTOSPI_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_OCTOSPI_REQUIRED        FALSE
#endif

/**
 * @brief   Enables demand for the I3C1 clock.
 */
#if !defined(STM32_CFG_I3C1_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_I3C1_REQUIRED           FALSE
#endif

/**
 * @brief   Enables demand for the I3C2 clock.
 */
#if !defined(STM32_CFG_I3C2_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_I3C2_REQUIRED           FALSE
#endif

/**
 * @brief   Enables demand for the SAI1 clock.
 */
#if !defined(STM32_CFG_SAI1_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_SAI1_REQUIRED           FALSE
#endif

/**
 * @brief   Enables demand for the ADF1 clock.
 */
#if !defined(STM32_CFG_ADF1_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_ADF1_REQUIRED           FALSE
#endif

/**
 * @brief   Enables the HSI16 clock source.
 */
#if !defined(STM32_CFG_HSI16_ENABLE) || defined(__DOXYGEN__)
  #define STM32_CFG_HSI16_ENABLE            FALSE
#endif

/**
 * @brief   Enables the HSI48 clock source.
 */
#if !defined(STM32_CFG_HSI48_ENABLE) || defined(__DOXYGEN__)
  #define STM32_CFG_HSI48_ENABLE            FALSE
#endif

/**
 * @brief   Enables the HSE clock source.
 */
#if !defined(STM32_CFG_HSE_ENABLE) || defined(__DOXYGEN__)
  #define STM32_CFG_HSE_ENABLE              FALSE
#endif

/**
 * @brief   Enables the LSE clock source.
 */
#if !defined(STM32_CFG_LSE_ENABLE) || defined(__DOXYGEN__)
  #define STM32_CFG_LSE_ENABLE              TRUE
#endif

/**
 * @brief   Enables the LSI clock source.
 */
#if !defined(STM32_CFG_LSI_ENABLE) || defined(__DOXYGEN__)
  #define STM32_CFG_LSI_ENABLE              FALSE
#endif

/**
 * @brief   Selects the SYSCLK clock source.
 * @note    Allowed sources:
 *          - MSIS.
 *          - HSI16.
 *          - HSE.
 */
#if !defined(STM32_CFG_SYSCLK_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SYSCLK_SEL              RCC_CFGR1_SW_MSIS
#endif

/**
 * @brief   Configures the HCLK clock divider value.
 */
#if !defined(STM32_CFG_HCLK_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_HCLK_VALUE              1
#endif

/**
 * @brief   Configures the PCLK1 clock divider value.
 */
#if !defined(STM32_CFG_PCLK1_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PCLK1_VALUE             1
#endif

/**
 * @brief   Configures the PCLK2 clock divider value.
 */
#if !defined(STM32_CFG_PCLK2_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PCLK2_VALUE             1
#endif

/**
 * @brief   Configures the PCLK3 clock divider value.
 */
#if !defined(STM32_CFG_PCLK3_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PCLK3_VALUE             1
#endif

/**
 * @brief   Selects the MCO1DIV clock source.
 * @note    Allowed sources:
 *          - NONE.
 *          - SYSCLK.
 *          - MSIS.
 *          - HSI16.
 *          - HSE.
 *          - LSI.
 *          - LSE.
 *          - HSI48.
 *          - MSIK.
 */
#if !defined(STM32_CFG_MCO1DIV_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_MCO1DIV_SEL             RCC_CFGR1_MCO1SEL_OFF
#endif

/**
 * @brief   Configures the MCO1 clock divider value.
 */
#if !defined(STM32_CFG_MCO1_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_MCO1_VALUE              1
#endif

/**
 * @brief   Selects the MCO2DIV clock source.
 * @note    Allowed sources:
 *          - NONE.
 *          - SYSCLK.
 *          - MSIS.
 *          - HSI16.
 *          - HSE.
 *          - LSI.
 *          - LSE.
 *          - HSI48.
 *          - MSIK.
 */
#if !defined(STM32_CFG_MCO2DIV_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_MCO2DIV_SEL             RCC_CFGR1_MCO2SEL_OFF
#endif

/**
 * @brief   Configures the MCO2 clock divider value.
 */
#if !defined(STM32_CFG_MCO2_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_MCO2_VALUE              1
#endif

/**
 * @brief   Selects the RTC clock source.
 * @note    Allowed sources:
 *          - NONE.
 *          - LSE.
 *          - LSI.
 *          - HSEDIV.
 */
#if !defined(STM32_CFG_RTC_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_RTC_SEL                 RCC_BDCR_RTCSEL_NOCLOCK
#endif

/**
 * @brief   Selects the LSCO clock source.
 * @note    Allowed sources:
 *          - NONE.
 *          - LSI.
 *          - LSE.
 */
#if !defined(STM32_CFG_LSCO_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_LSCO_SEL                RCC_BDCR_LSCOSEL_NOCLOCK
#endif

/**
 * @brief   Selects the USART1 clock source.
 * @note    Allowed sources:
 *          - PCLK2.
 *          - HSI16.
 */
#if !defined(STM32_CFG_USART1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_USART1_SEL              RCC_CCIPR1_USART1SEL_PCLK2
#endif

/**
 * @brief   Selects the USART3 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - HSI16.
 */
#if !defined(STM32_CFG_USART3_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_USART3_SEL              RCC_CCIPR1_USART3SEL_PCLK1
#endif

/**
 * @brief   Selects the UART4 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - HSI16.
 */
#if !defined(STM32_CFG_UART4_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_UART4_SEL               RCC_CCIPR1_UART4SEL_PCLK1
#endif

/**
 * @brief   Selects the UART5 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - HSI16.
 */
#if !defined(STM32_CFG_UART5_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_UART5_SEL               RCC_CCIPR1_UART5SEL_PCLK1
#endif

/**
 * @brief   Selects the LPUART1 clock source.
 * @note    Allowed sources:
 *          - PCLK3.
 *          - HSI16.
 *          - LSE.
 *          - MSIK.
 */
#if !defined(STM32_CFG_LPUART1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_LPUART1_SEL             RCC_CCIPR3_LPUART1SEL_PCLK3
#endif

/**
 * @brief   Selects the LPTIM1 clock source.
 * @note    Allowed sources:
 *          - MSIK.
 *          - LSI.
 *          - HSI16.
 *          - LSE.
 */
#if !defined(STM32_CFG_LPTIM1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_LPTIM1_SEL              RCC_CCIPR3_LPTIM1SEL_MSIK
#endif

/**
 * @brief   Selects the LPTIM2 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - LSI.
 *          - HSI16.
 *          - LSE.
 */
#if !defined(STM32_CFG_LPTIM2_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_LPTIM2_SEL              RCC_CCIPR1_LPTIM2SEL_PCLK1
#endif

/**
 * @brief   Selects the LPTIM34 clock source.
 * @note    Allowed sources:
 *          - MSIK.
 *          - LSI.
 *          - HSI16.
 *          - LSE.
 */
#if !defined(STM32_CFG_LPTIM34_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_LPTIM34_SEL             RCC_CCIPR3_LPTIM34SEL_MSIK
#endif

/**
 * @brief   Selects the SPI1 clock source.
 * @note    Allowed sources:
 *          - PCLK2.
 *          - MSIK.
 */
#if !defined(STM32_CFG_SPI1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SPI1_SEL                RCC_CCIPR1_SPI1SEL_PCLK2
#endif

/**
 * @brief   Selects the SPI2 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - MSIK.
 */
#if !defined(STM32_CFG_SPI2_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SPI2_SEL                RCC_CCIPR1_SPI2SEL_PCLK1
#endif

/**
 * @brief   Selects the SPI3 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - MSIK.
 */
#if !defined(STM32_CFG_SPI3_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SPI3_SEL                RCC_CCIPR2_SPI3SEL_PCLK1
#endif

/**
 * @brief   Selects the OCTOSPI clock source.
 * @note    Allowed sources:
 *          - SYSCLK.
 *          - MSIK.
 */
#if !defined(STM32_CFG_OCTOSPI_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_OCTOSPI_SEL             RCC_CCIPR2_OCTOSPISEL_SYSCLK
#endif

/**
 * @brief   Selects the SYSTICK clock source.
 * @note    Allowed sources:
 *          - HCLKDIV8.
 *          - LSI.
 *          - LSE.
 */
#if !defined(STM32_CFG_SYSTICK_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SYSTICK_SEL             RCC_CCIPR1_SYSTICKSEL_HCLKDIV8
#endif

/**
 * @brief   Selects the ICLK clock source.
 * @note    Allowed sources:
 *          - HSI48.
 *          - MSIK.
 *          - HSE.
 *          - SYSCLK.
 */
#if !defined(STM32_CFG_ICLK_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_ICLK_SEL                RCC_CCIPR1_ICLKSEL_SYSCLK
#endif

/**
 * @brief   Selects the USB clock source.
 * @note    Allowed sources:
 *          - ICLK.
 *          - ICLKDIV2.
 */
#if !defined(STM32_CFG_USB_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_USB_SEL                 RCC_CCIPR1_USB1SEL_ICLKDIV2
#endif

/**
 * @brief   Selects the I2C1 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - MSIK.
 */
#if !defined(STM32_CFG_I2C1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_I2C1_SEL                RCC_CCIPR1_I2C1SEL_PCLK1
#endif

/**
 * @brief   Selects the I2C2 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - MSIK.
 */
#if !defined(STM32_CFG_I2C2_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_I2C2_SEL                RCC_CCIPR1_I2C2SEL_PCLK1
#endif

/**
 * @brief   Selects the I2C3 clock source.
 * @note    Allowed sources:
 *          - PCLK3.
 *          - MSIK.
 */
#if !defined(STM32_CFG_I2C3_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_I2C3_SEL                RCC_CCIPR3_I2C3SEL_PCLK3
#endif

/**
 * @brief   Selects the I3C1 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - MSIK.
 */
#if !defined(STM32_CFG_I3C1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_I3C1_SEL                RCC_CCIPR1_I3C1SEL_PCLK1
#endif

/**
 * @brief   Selects the I3C2 clock source.
 * @note    Allowed sources:
 *          - PCLK2.
 *          - MSIK.
 */
#if !defined(STM32_CFG_I3C2_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_I3C2_SEL                RCC_CCIPR1_I3C2SEL_PCLK2
#endif

/**
 * @brief   Selects the ADCDACICLK clock source.
 * @note    Allowed sources:
 *          - HCLK.
 *          - HSE.
 *          - MSIK.
 */
#if !defined(STM32_CFG_ADCDACICLK_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_ADCDACICLK_SEL          RCC_CCIPR2_ADCDACSEL_HCLK
#endif

/**
 * @brief   Configures the ADCDACPRE clock divider value.
 */
#if !defined(STM32_CFG_ADCDACPRE_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_ADCDACPRE_VALUE         1
#endif

/**
 * @brief   Selects the DAC1SH clock source.
 * @note    Allowed sources:
 *          - LSE.
 *          - LSI.
 *          - inactive selection RCC_CCIPR2_DAC1SHSEL_IGNORE.
 */
#if !defined(STM32_CFG_DAC1SH_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_DAC1SH_SEL              RCC_CCIPR2_DAC1SHSEL_LSE
#endif

/**
 * @brief   Selects the RNG clock source.
 * @note    Allowed sources:
 *          - HSI48.
 *          - MSIK.
 *          - inactive selection RCC_CCIPR2_RNGSEL_IGNORE.
 */
#if !defined(STM32_CFG_RNG_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_RNG_SEL                 RCC_CCIPR2_RNGSEL_MSIK
#endif

/**
 * @brief   Selects the FDCAN1 clock source.
 * @note    Allowed sources:
 *          - SYSCLK.
 *          - MSIK.
 *          - inactive selection RCC_CCIPR1_FDCAN1SEL_IGNORE.
 */
#if !defined(STM32_CFG_FDCAN1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_FDCAN1_SEL              RCC_CCIPR1_FDCAN1SEL_SYSCLK
#endif

/**
 * @brief   Selects the SAI1 clock source.
 * @note    Allowed sources:
 *          - MSIK.
 *          - AUDIOCLK.
 *          - HSE.
 */
#if !defined(STM32_CFG_SAI1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SAI1_SEL                RCC_CCIPR2_SAI1SEL_MSIK
#endif

/**
 * @brief   Selects the ADF1 clock source.
 * @note    Allowed sources:
 *          - HCLK.
 *          - AUDIOCLK.
 *          - HSE.
 *          - SAI1.
 */
#if !defined(STM32_CFG_ADF1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_ADF1_SEL                RCC_CCIPR2_ADF1SEL_HCLK
#endif
/** @} */

/*===========================================================================*/
/* Derived constants and error checks.                                       */
/*===========================================================================*/

/**
 * @name    Clock point derived constants and checks
 * @{
 */
/*
 * Extra configuration checks.
 */
#if !defined(TRUE) && !defined(__DOXYGEN__)
  #error "TRUE not defined"
#endif
#if !defined(FALSE) && !defined(__DOXYGEN__)
  #error "FALSE not defined"
#endif
#if !((STM32_CFG_CLOCK_DYNAMIC == TRUE) || (STM32_CFG_CLOCK_DYNAMIC == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_CLOCK_DYNAMIC value specified"
#endif

#if !defined(PWR_VOSR_RANGE1) && !defined(__DOXYGEN__)
  #error "PWR_VOSR_RANGE1 not defined"
#endif
#if !defined(PWR_VOSR_RANGE2) && !defined(__DOXYGEN__)
  #error "PWR_VOSR_RANGE2 not defined"
#endif
#if !((STM32_CFG_PWR_VOSR == PWR_VOSR_RANGE1) ||                            \
     (STM32_CFG_PWR_VOSR == PWR_VOSR_RANGE2)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PWR_VOSR value specified"
#endif

#if !defined(RCC_MSIRC0_FREE) && !defined(__DOXYGEN__)
  #error "RCC_MSIRC0_FREE not defined"
#endif
#if !defined(RCC_MSIRC0_PLL_LSE) && !defined(__DOXYGEN__)
  #error "RCC_MSIRC0_PLL_LSE not defined"
#endif
#if !defined(RCC_MSIRC0_PLL_HSE) && !defined(__DOXYGEN__)
  #error "RCC_MSIRC0_PLL_HSE not defined"
#endif
#if !defined(RCC_MSIRC0_PLL_LSE_FAST) && !defined(__DOXYGEN__)
  #error "RCC_MSIRC0_PLL_LSE_FAST not defined"
#endif
#if !defined(RCC_MSIRC0_PLL_HSE_FAST) && !defined(__DOXYGEN__)
  #error "RCC_MSIRC0_PLL_HSE_FAST not defined"
#endif
#if !((STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_FREE) ||                         \
     (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE) ||                       \
     (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_HSE) ||                       \
     (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE_FAST) ||                  \
     (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_HSE_FAST)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_MSIRC0_MODE value specified"
#endif

#if !defined(RCC_MSIRC1_FREE) && !defined(__DOXYGEN__)
  #error "RCC_MSIRC1_FREE not defined"
#endif
#if !defined(RCC_MSIRC1_PLL_LSE) && !defined(__DOXYGEN__)
  #error "RCC_MSIRC1_PLL_LSE not defined"
#endif
#if !defined(RCC_MSIRC1_PLL_HSE) && !defined(__DOXYGEN__)
  #error "RCC_MSIRC1_PLL_HSE not defined"
#endif
#if !defined(RCC_MSIRC1_PLL_LSE_FAST) && !defined(__DOXYGEN__)
  #error "RCC_MSIRC1_PLL_LSE_FAST not defined"
#endif
#if !defined(RCC_MSIRC1_PLL_HSE_FAST) && !defined(__DOXYGEN__)
  #error "RCC_MSIRC1_PLL_HSE_FAST not defined"
#endif
#if !((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_FREE) ||                         \
     (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) ||                       \
     (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) ||                       \
     (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST) ||                  \
     (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_MSIRC1_MODE value specified"
#endif

#if !((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1) || \
     (STM32_CFG_MSIPLL1N_VALUE == 2) || (STM32_CFG_MSIPLL1N_VALUE == 3)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_MSIPLL1N_VALUE value specified"
#endif

