qmk/ChibiOS/os/hal/ports/STM32/STM32U3xx_TEST/clocktree.h
#if !defined(RCC_ICSCR1_MSIS_IRC0_DIV1) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIS_IRC0_DIV1 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIS_IRC0_DIV2) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIS_IRC0_DIV2 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIS_IRC0_DIV4) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIS_IRC0_DIV4 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIS_IRC0_DIV8) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIS_IRC0_DIV8 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIS_IRC1_DIV1) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIS_IRC1_DIV1 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIS_IRC1_DIV2) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIS_IRC1_DIV2 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIS_IRC1_DIV4) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIS_IRC1_DIV4 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIS_IRC1_DIV8) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIS_IRC1_DIV8 not defined"
#endif
#if !((STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC0_DIV1) ||               \
     (STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC0_DIV2) ||                \
     (STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC0_DIV4) ||                \
     (STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC0_DIV8) ||                \
     (STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC1_DIV1) ||                \
     (STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC1_DIV2) ||                \
     (STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC1_DIV4) ||                \
     (STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC1_DIV8)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_MSIS_SRCDIV value specified"
#endif

#if !defined(RCC_ICSCR1_MSIK_IRC0_DIV1) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIK_IRC0_DIV1 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIK_IRC0_DIV2) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIK_IRC0_DIV2 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIK_IRC0_DIV4) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIK_IRC0_DIV4 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIK_IRC0_DIV8) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIK_IRC0_DIV8 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIK_IRC1_DIV1) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIK_IRC1_DIV1 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIK_IRC1_DIV2) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIK_IRC1_DIV2 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIK_IRC1_DIV4) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIK_IRC1_DIV4 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIK_IRC1_DIV8) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIK_IRC1_DIV8 not defined"
#endif
#if !((STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV1) ||               \
     (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV2) ||                \
     (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV4) ||                \
     (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV8) ||                \
     (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV1) ||                \
     (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV2) ||                \
     (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV4) ||                \
     (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV8)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_MSIK_SRCDIV value specified"
#endif

#if !defined(RCC_CFGR1_STOPWUCK_MSIS) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_STOPWUCK_MSIS not defined"
#endif
#if !defined(RCC_CFGR1_STOPWUCK_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_STOPWUCK_HSI16 not defined"
#endif
#if !((STM32_CFG_STOPWUCK == RCC_CFGR1_STOPWUCK_MSIS) ||                    \
     (STM32_CFG_STOPWUCK == RCC_CFGR1_STOPWUCK_HSI16)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_STOPWUCK value specified"
#endif

#if !defined(RCC_CFGR1_STOPKERWUCK_MSIK) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_STOPKERWUCK_MSIK not defined"
#endif
#if !defined(RCC_CFGR1_STOPKERWUCK_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_STOPKERWUCK_HSI16 not defined"
#endif
#if !((STM32_CFG_STOPKERWUCK == RCC_CFGR1_STOPKERWUCK_MSIK) ||              \
     (STM32_CFG_STOPKERWUCK == RCC_CFGR1_STOPKERWUCK_HSI16)) &&             \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_STOPKERWUCK value specified"
#endif

#if !defined(RCC_ICSCR1_MSIBIAS_CONTINUOUS) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIBIAS_CONTINUOUS not defined"
#endif
#if !defined(RCC_ICSCR1_MSIBIAS_SAMPLING) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIBIAS_SAMPLING not defined"
#endif
#if !((STM32_CFG_MSIBIAS == RCC_ICSCR1_MSIBIAS_CONTINUOUS) ||               \
     (STM32_CFG_MSIBIAS == RCC_ICSCR1_MSIBIAS_SAMPLING)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_MSIBIAS value specified"
#endif

#if !defined(RCC_CCIPR1_TIMICSEL_NOCLOCK) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR1_TIMICSEL_NOCLOCK not defined"
#endif
#if !defined(RCC_CCIPR1_TIMICSEL_HSI256_MSIS1024_MSIS4) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR1_TIMICSEL_HSI256_MSIS1024_MSIS4 not defined"
#endif
#if !defined(RCC_CCIPR1_TIMICSEL_HSI256_MSIS1024_MSIK4) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR1_TIMICSEL_HSI256_MSIS1024_MSIK4 not defined"
#endif
#if !defined(RCC_CCIPR1_TIMICSEL_HSI256_MSIK1024_MSIS4) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR1_TIMICSEL_HSI256_MSIK1024_MSIS4 not defined"
#endif
#if !defined(RCC_CCIPR1_TIMICSEL_HSI256_MSIK1024_MSIK4) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR1_TIMICSEL_HSI256_MSIK1024_MSIK4 not defined"
#endif
#if !((STM32_CFG_TIMICSEL == RCC_CCIPR1_TIMICSEL_NOCLOCK) ||                \
     (STM32_CFG_TIMICSEL == RCC_CCIPR1_TIMICSEL_HSI256_MSIS1024_MSIS4) ||   \
     (STM32_CFG_TIMICSEL == RCC_CCIPR1_TIMICSEL_HSI256_MSIS1024_MSIK4) ||   \
     (STM32_CFG_TIMICSEL == RCC_CCIPR1_TIMICSEL_HSI256_MSIK1024_MSIS4) ||   \
     (STM32_CFG_TIMICSEL == RCC_CCIPR1_TIMICSEL_HSI256_MSIK1024_MSIK4)) &&  \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_TIMICSEL value specified"
#endif

