qmk/ChibiOS/os/hal/ports/STM32/STM32U3xx_TEST/clocktree.h
#if !((STM32_CFG_DAC1SH_REQUIRED == TRUE) ||                                \
     (STM32_CFG_DAC1SH_REQUIRED == FALSE)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_DAC1SH_REQUIRED value specified"
#endif

#if !((STM32_CFG_LPTIM1_REQUIRED == TRUE) ||                                \
     (STM32_CFG_LPTIM1_REQUIRED == FALSE)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_LPTIM1_REQUIRED value specified"
#endif

#if !((STM32_CFG_LPTIM2_REQUIRED == TRUE) ||                                \
     (STM32_CFG_LPTIM2_REQUIRED == FALSE)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_LPTIM2_REQUIRED value specified"
#endif

#if !((STM32_CFG_LPTIM34_REQUIRED == TRUE) ||                               \
     (STM32_CFG_LPTIM34_REQUIRED == FALSE)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_LPTIM34_REQUIRED value specified"
#endif

#if !((STM32_CFG_OCTOSPI_REQUIRED == TRUE) ||                               \
     (STM32_CFG_OCTOSPI_REQUIRED == FALSE)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_OCTOSPI_REQUIRED value specified"
#endif

#if !((STM32_CFG_I3C1_REQUIRED == TRUE) || (STM32_CFG_I3C1_REQUIRED == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_I3C1_REQUIRED value specified"
#endif

#if !((STM32_CFG_I3C2_REQUIRED == TRUE) || (STM32_CFG_I3C2_REQUIRED == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_I3C2_REQUIRED value specified"
#endif

#if !((STM32_CFG_SAI1_REQUIRED == TRUE) || (STM32_CFG_SAI1_REQUIRED == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_SAI1_REQUIRED value specified"
#endif

#if !((STM32_CFG_ADF1_REQUIRED == TRUE) || (STM32_CFG_ADF1_REQUIRED == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_ADF1_REQUIRED value specified"
#endif

/**
 * @name    Frequency limits for vos1 state
 * @{
 */
#if defined(STM32_HSE_BYPASS) || \
    defined(__DOXYGEN__)
#define STM32_VOS1_HSECLK_MIN               4000000
#define STM32_VOS1_HSECLK_MAX               50000000
#else
#define STM32_VOS1_HSECLK_MIN               4000000
#define STM32_VOS1_HSECLK_MAX               50000000
#endif
#if defined(STM32_LSE_BYPASS) || \
    defined(__DOXYGEN__)
#define STM32_VOS1_LSECLK_MIN               5000
#define STM32_VOS1_LSECLK_MAX               40000
#else
#define STM32_VOS1_LSECLK_MIN               32768
#define STM32_VOS1_LSECLK_MAX               32768
#endif
#define STM32_VOS1_SYSCLK_MAX               96010000
#define STM32_VOS1_HCLK_MAX                 96010000
#define STM32_VOS1_PCLK1_MAX                96010000
#define STM32_VOS1_PCLK2_MAX                96010000
#define STM32_VOS1_PCLK3_MAX                96010000
#define STM32_VOS1_ADCCLK_MAX               55000000
#define STM32_VOS1_USBCLK_MIN               47880000
#define STM32_VOS1_USBCLK_MAX               48120000
#if ((STM32_FLASH_ACR & FLASH_ACR_LPM) == 0) || \
    defined(__DOXYGEN__)
#define STM32_VOS1_FLASH_0WS_MAX            32005000
#else
#define STM32_VOS1_FLASH_0WS_MAX            20000000
#endif
#if ((STM32_FLASH_ACR & FLASH_ACR_LPM) == 0) || \
    defined(__DOXYGEN__)
#define STM32_VOS1_FLASH_1WS_MAX            64007500
#else
#define STM32_VOS1_FLASH_1WS_MAX            40000000
#endif
#if ((STM32_FLASH_ACR & FLASH_ACR_LPM) == 0) || \
    defined(__DOXYGEN__)
#define STM32_VOS1_FLASH_2WS_MAX            96010000
#else
#define STM32_VOS1_FLASH_2WS_MAX            60000000
#endif
#if ((STM32_FLASH_ACR & FLASH_ACR_LPM) == 0) || \
    defined(__DOXYGEN__)
#define STM32_VOS1_FLASH_3WS_MAX            0
#else
#define STM32_VOS1_FLASH_3WS_MAX            80000000
#endif
#if ((STM32_FLASH_ACR & FLASH_ACR_LPM) == 0) || \
    defined(__DOXYGEN__)
#define STM32_VOS1_FLASH_4WS_MAX            0
#else
#define STM32_VOS1_FLASH_4WS_MAX            96010000
#endif
/** @} */

/**
 * @name    Frequency limits for vos2 state
 * @{
 */
#if defined(STM32_HSE_BYPASS) || \
    defined(__DOXYGEN__)
#define STM32_VOS2_HSECLK_MIN               4000000
#define STM32_VOS2_HSECLK_MAX               48000000
#else
#define STM32_VOS2_HSECLK_MIN               4000000
#define STM32_VOS2_HSECLK_MAX               48000000
#endif
#if defined(STM32_LSE_BYPASS) || \
    defined(__DOXYGEN__)
#define STM32_VOS2_LSECLK_MIN               5000
#define STM32_VOS2_LSECLK_MAX               40000
#else
#define STM32_VOS2_LSECLK_MIN               32768
#define STM32_VOS2_LSECLK_MAX               32768
#endif
#define STM32_VOS2_SYSCLK_MAX               48005000
#define STM32_VOS2_HCLK_MAX                 48005000
#define STM32_VOS2_PCLK1_MAX                48005000
#define STM32_VOS2_PCLK2_MAX                48005000
#define STM32_VOS2_PCLK3_MAX                48005000
#define STM32_VOS2_ADCCLK_MAX               48005000
#define STM32_VOS2_USBCLK_MIN               47880000
#define STM32_VOS2_USBCLK_MAX               48120000
#define STM32_VOS2_FLASH_0WS_MAX            16001250
#define STM32_VOS2_FLASH_1WS_MAX            32002500
#define STM32_VOS2_FLASH_2WS_MAX            48005000
#define STM32_VOS2_FLASH_3WS_MAX            0
#define STM32_VOS2_FLASH_4WS_MAX            0
/** @} */

/*
 * Selected frequency limits.
 */
#if (STM32_CFG_PWR_VOSR == PWR_VOSR_RANGE1) || \
    defined(__DOXYGEN__)
#define STM32_HSECLK_MIN                    STM32_VOS1_HSECLK_MIN
#define STM32_HSECLK_MAX                    STM32_VOS1_HSECLK_MAX
#define STM32_LSECLK_MIN                    STM32_VOS1_LSECLK_MIN
#define STM32_LSECLK_MAX                    STM32_VOS1_LSECLK_MAX
#define STM32_SYSCLK_MAX                    STM32_VOS1_SYSCLK_MAX
#define STM32_HCLK_MAX                      STM32_VOS1_HCLK_MAX
#define STM32_PCLK1_MAX                     STM32_VOS1_PCLK1_MAX
#define STM32_PCLK2_MAX                     STM32_VOS1_PCLK2_MAX
#define STM32_PCLK3_MAX                     STM32_VOS1_PCLK3_MAX
#define STM32_ADCCLK_MAX                    STM32_VOS1_ADCCLK_MAX
#define STM32_USBCLK_MIN                    STM32_VOS1_USBCLK_MIN
#define STM32_USBCLK_MAX                    STM32_VOS1_USBCLK_MAX
#define STM32_FLASH_0WS_MAX                 STM32_VOS1_FLASH_0WS_MAX
#define STM32_FLASH_1WS_MAX                 STM32_VOS1_FLASH_1WS_MAX
#define STM32_FLASH_2WS_MAX                 STM32_VOS1_FLASH_2WS_MAX
#define STM32_FLASH_3WS_MAX                 STM32_VOS1_FLASH_3WS_MAX
#define STM32_FLASH_4WS_MAX                 STM32_VOS1_FLASH_4WS_MAX
#elif (STM32_CFG_PWR_VOSR == PWR_VOSR_RANGE2)
#define STM32_HSECLK_MIN                    STM32_VOS2_HSECLK_MIN
#define STM32_HSECLK_MAX                    STM32_VOS2_HSECLK_MAX
#define STM32_LSECLK_MIN                    STM32_VOS2_LSECLK_MIN
#define STM32_LSECLK_MAX                    STM32_VOS2_LSECLK_MAX
#define STM32_SYSCLK_MAX                    STM32_VOS2_SYSCLK_MAX
#define STM32_HCLK_MAX                      STM32_VOS2_HCLK_MAX
#define STM32_PCLK1_MAX                     STM32_VOS2_PCLK1_MAX
#define STM32_PCLK2_MAX                     STM32_VOS2_PCLK2_MAX
#define STM32_PCLK3_MAX                     STM32_VOS2_PCLK3_MAX
#define STM32_ADCCLK_MAX                    STM32_VOS2_ADCCLK_MAX
#define STM32_USBCLK_MIN                    STM32_VOS2_USBCLK_MIN
#define STM32_USBCLK_MAX                    STM32_VOS2_USBCLK_MAX
#define STM32_FLASH_0WS_MAX                 STM32_VOS2_FLASH_0WS_MAX
#define STM32_FLASH_1WS_MAX                 STM32_VOS2_FLASH_1WS_MAX
#define STM32_FLASH_2WS_MAX                 STM32_VOS2_FLASH_2WS_MAX
#define STM32_FLASH_3WS_MAX                 STM32_VOS2_FLASH_3WS_MAX
#define STM32_FLASH_4WS_MAX                 STM32_VOS2_FLASH_4WS_MAX
#else
  #error "unable to select clock frequency limits"
#endif

/**
 * @brief   NONE clock derived enable state.
 */
#define STM32_NONE_ENABLED                  FALSE

/**
 * @brief   AUDIOCLK clock derived enable state.
 */
#define STM32_AUDIOCLK_ENABLED              TRUE

/**
 * @brief   HSI16 clock derived enable state.
 */
#define STM32_HSI16_ENABLED                 STM32_CFG_HSI16_ENABLE

/**
 * @brief   HSI48 clock derived enable state.
 */
#define STM32_HSI48_ENABLED                 STM32_CFG_HSI48_ENABLE

/**
 * @brief   HSE clock derived enable state.
 */
#define STM32_HSE_ENABLED                   STM32_CFG_HSE_ENABLE

/**
 * @brief   LSE clock derived enable state.
 */
#define STM32_LSE_ENABLED                   STM32_CFG_LSE_ENABLE

/**
 * @brief   LSI clock derived enable state.
 */
#define STM32_LSI_ENABLED                   STM32_CFG_LSI_ENABLE

/**
 * @brief   MSIRC0 clock derived enable state.
 */
#define STM32_MSIRC0_ENABLED                (((STM32_MSIS_ENABLED == TRUE) && \
                                              ((STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC0_DIV1) || \
                                               (STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC0_DIV2) || \
                                               (STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC0_DIV4) || \
                                               (STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC0_DIV8))) || \
                                             ((STM32_MSIK_ENABLED == TRUE) && \
                                              ((STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV1) || \
                                               (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV2) || \
                                               (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV4) || \
                                               (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV8))))

/**
 * @brief   MSIRC1 clock derived enable state.
 */
#define STM32_MSIRC1_ENABLED                (((STM32_MSIS_ENABLED == TRUE) && \
                                              ((STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC1_DIV1) || \
                                               (STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC1_DIV2) || \
                                               (STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC1_DIV4) || \
                                               (STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC1_DIV8))) || \
                                             ((STM32_MSIK_ENABLED == TRUE) && \
                                              ((STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV1) || \
                                               (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV2) || \
                                               (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV4) || \
                                               (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV8))))

/**
 * @brief   MSIS clock derived enable state.
 */
#define STM32_MSIS_ENABLED                  ((STM32_CFG_TIMICSEL != RCC_CCIPR1_TIMICSEL_NOCLOCK) || \
                                             ((STM32_SYSCLK_ENABLED == TRUE) && \
                                              (STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_MSIS)) || \
                                             ((STM32_MCO1DIV_ENABLED == TRUE) && \
                                              (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_MSIS)) || \
                                             ((STM32_MCO2DIV_ENABLED == TRUE) && \
                                              (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_MSIS)))

/**
 * @brief   MSIK clock derived enable state.
 */
#define STM32_MSIK_ENABLED                  ((STM32_CFG_TIMICSEL != RCC_CCIPR1_TIMICSEL_NOCLOCK) || \
                                             ((STM32_MCO1DIV_ENABLED == TRUE) && \
                                              (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_MSIK)) || \
                                             ((STM32_MCO2DIV_ENABLED == TRUE) && \
                                              (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_MSIK)) || \
                                             ((STM32_LPUART1_ENABLED == TRUE) && \
                                              (STM32_CFG_LPUART1_SEL == RCC_CCIPR3_LPUART1SEL_MSIK)) || \
                                             ((STM32_LPTIM1_ENABLED == TRUE) && \
                                              (STM32_CFG_LPTIM1_SEL == RCC_CCIPR3_LPTIM1SEL_MSIK)) || \
                                             ((STM32_LPTIM34_ENABLED == TRUE) && \
                                              (STM32_CFG_LPTIM34_SEL == RCC_CCIPR3_LPTIM34SEL_MSIK)) || \
                                             ((STM32_SPI1_ENABLED == TRUE) && \
                                              (STM32_CFG_SPI1_SEL == RCC_CCIPR1_SPI1SEL_MSIK)) || \
                                             ((STM32_SPI2_ENABLED == TRUE) && \
                                              (STM32_CFG_SPI2_SEL == RCC_CCIPR1_SPI2SEL_MSIK)) || \
                                             ((STM32_SPI3_ENABLED == TRUE) && \
                                              (STM32_CFG_SPI3_SEL == RCC_CCIPR2_SPI3SEL_MSIK)) || \
                                             ((STM32_OCTOSPI_ENABLED == TRUE) && \
                                              (STM32_CFG_OCTOSPI_SEL == RCC_CCIPR2_OCTOSPISEL_MSIK)) || \
                                             ((STM32_ICLK_ENABLED == TRUE) && \
                                              (STM32_CFG_ICLK_SEL == RCC_CCIPR1_ICLKSEL_MSIK)) || \
                                             ((STM32_I2C1_ENABLED == TRUE) && \
                                              (STM32_CFG_I2C1_SEL == RCC_CCIPR1_I2C1SEL_MSIK)) || \
                                             ((STM32_I2C2_ENABLED == TRUE) && \
                                              (STM32_CFG_I2C2_SEL == RCC_CCIPR1_I2C2SEL_MSIK)) || \
                                             ((STM32_I2C3_ENABLED == TRUE) && \
                                              (STM32_CFG_I2C3_SEL == RCC_CCIPR3_I2C3SEL_MSIK)) || \
                                             ((STM32_I3C1_ENABLED == TRUE) && \
                                              (STM32_CFG_I3C1_SEL == RCC_CCIPR1_I3C1SEL_MSIK)) || \
                                             ((STM32_I3C2_ENABLED == TRUE) && \
                                              (STM32_CFG_I3C2_SEL == RCC_CCIPR1_I3C2SEL_MSIK)) || \
                                             ((STM32_ADCDACICLK_ENABLED == TRUE) && \
                                              (STM32_CFG_ADCDACICLK_SEL == RCC_CCIPR2_ADCDACSEL_MSIK)) || \
                                             ((STM32_RNG_ENABLED == TRUE) && \
                                              (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_MSIK)) || \
                                             ((STM32_FDCAN1_ENABLED == TRUE) && \
                                              (STM32_CFG_FDCAN1_SEL == RCC_CCIPR1_FDCAN1SEL_MSIK)) || \
                                             ((STM32_SAI1_ENABLED == TRUE) && \
                                              (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_MSIK)))

/**
 * @brief   SYSCLK clock derived enable state.
 */
#define STM32_SYSCLK_ENABLED                TRUE

/**
 * @brief   HCLK clock derived enable state.
 */
#define STM32_HCLK_ENABLED                  TRUE

/**
 * @brief   PCLK1 clock derived enable state.
 */
#define STM32_PCLK1_ENABLED                 TRUE

/**
 * @brief   PCLK1TIM clock derived enable state.
 */
#define STM32_PCLK1TIM_ENABLED              TRUE

/**
 * @brief   PCLK2 clock derived enable state.
 */
#define STM32_PCLK2_ENABLED                 TRUE

/**
 * @brief   PCLK2TIM clock derived enable state.
 */
#define STM32_PCLK2TIM_ENABLED              TRUE

/**
 * @brief   PCLK3 clock derived enable state.
 */
#define STM32_PCLK3_ENABLED                 TRUE

/**
 * @brief   HSEDIV clock derived enable state.
 */
#define STM32_HSEDIV_ENABLED                (((STM32_RTC_ENABLED == TRUE) && \
                                              (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_HSEDIV)))

/**
 * @brief   HCLKDIV8 clock derived enable state.
 */
#define STM32_HCLKDIV8_ENABLED              TRUE

/**
 * @brief   MCO1DIV clock derived enable state.
 */
#define STM32_MCO1DIV_ENABLED               TRUE

/**
 * @brief   MCO1 clock derived enable state.
 */
#define STM32_MCO1_ENABLED                  TRUE

/**
 * @brief   MCO2DIV clock derived enable state.
 */
#define STM32_MCO2DIV_ENABLED               TRUE

/**
 * @brief   MCO2 clock derived enable state.
 */
#define STM32_MCO2_ENABLED                  TRUE

/**
 * @brief   RTC clock derived enable state.
 */
#define STM32_RTC_ENABLED                   TRUE

/**
 * @brief   LSCO clock derived enable state.
 */
#define STM32_LSCO_ENABLED                  TRUE

/**
 * @brief   USART1 clock derived enable state.
 */
#define STM32_USART1_ENABLED                (((HAL_USE_SERIAL == TRUE) &&   \
                                              (STM32_SERIAL_USE_USART1 == TRUE)) || \
                                             ((HAL_USE_SIO == TRUE) &&      \
                                              (STM32_SIO_USE_USART1 == TRUE)))

/**
 * @brief   USART3 clock derived enable state.
 */
#define STM32_USART3_ENABLED                (((HAL_USE_SERIAL == TRUE) &&   \
                                              (STM32_SERIAL_USE_USART3 == TRUE)) || \
                                             ((HAL_USE_SIO == TRUE) &&      \
                                              (STM32_SIO_USE_USART3 == TRUE)))

/**
 * @brief   UART4 clock derived enable state.
 */
#define STM32_UART4_ENABLED                 (((HAL_USE_SERIAL == TRUE) &&   \
                                              (STM32_SERIAL_USE_UART4 == TRUE)) || \
                                             ((HAL_USE_SIO == TRUE) &&      \
                                              (STM32_SIO_USE_UART4 == TRUE)))

/**
 * @brief   UART5 clock derived enable state.
 */
#define STM32_UART5_ENABLED                 (((HAL_USE_SERIAL == TRUE) &&   \
                                              (STM32_SERIAL_USE_UART5 == TRUE)) || \
                                             ((HAL_USE_SIO == TRUE) &&      \
                                              (STM32_SIO_USE_UART5 == TRUE)))

/**
 * @brief   LPUART1 clock derived enable state.
 */
#define STM32_LPUART1_ENABLED               (((HAL_USE_SERIAL == TRUE) &&   \
                                              (STM32_SERIAL_USE_LPUART1 == TRUE)) || \
                                             ((HAL_USE_SIO == TRUE) &&      \
                                              (STM32_SIO_USE_LPUART1 == TRUE)))

/**
 * @brief   LPTIM1 clock derived enable state.
 */
#define STM32_LPTIM1_ENABLED                ((STM32_CFG_LPTIM1_REQUIRED == TRUE))

/**
 * @brief   LPTIM2 clock derived enable state.
 */
#define STM32_LPTIM2_ENABLED                ((STM32_CFG_LPTIM2_REQUIRED == TRUE))

/**
 * @brief   LPTIM34 clock derived enable state.
 */
#define STM32_LPTIM34_ENABLED               ((STM32_CFG_LPTIM34_REQUIRED == TRUE))

/**
 * @brief   SPI1 clock derived enable state.
 */
#define STM32_SPI1_ENABLED                  (((HAL_USE_SPI == TRUE) &&      \
                                              (STM32_SPI_USE_SPI1 == TRUE)))

/**
 * @brief   SPI2 clock derived enable state.
 */
#define STM32_SPI2_ENABLED                  (((HAL_USE_SPI == TRUE) &&      \
                                              (STM32_SPI_USE_SPI2 == TRUE)))

/**
 * @brief   SPI3 clock derived enable state.
 */
#define STM32_SPI3_ENABLED                  (((HAL_USE_SPI == TRUE) &&      \
                                              (STM32_SPI_USE_SPI3 == TRUE)))

/**
 * @brief   OCTOSPI clock derived enable state.
 */
#define STM32_OCTOSPI_ENABLED               ((STM32_CFG_OCTOSPI_REQUIRED == TRUE))

/**
 * @brief   SYSTICK clock derived enable state.
 */
#define STM32_SYSTICK_ENABLED               TRUE

/**
 * @brief   TIM16IC clock derived enable state.
 */
#define STM32_TIM16IC_ENABLED               TRUE

/**
 * @brief   TIM17IC clock derived enable state.
 */
#define STM32_TIM17IC_ENABLED               TRUE

/**
 * @brief   LPTIM2IC clock derived enable state.
 */
#define STM32_LPTIM2IC_ENABLED              TRUE

/**
 * @brief   ICLK clock derived enable state.
 */
#define STM32_ICLK_ENABLED                  ((STM32_ICLKDIV2_ENABLED == TRUE) || \
                                             ((STM32_USB_ENABLED == TRUE) && \
                                              (STM32_CFG_USB_SEL == RCC_CCIPR1_USB1SEL_ICLK)) || \
                                             (STM32_SDMMC1_ENABLED == TRUE))

/**
 * @brief   ICLKDIV2 clock derived enable state.
 */
#define STM32_ICLKDIV2_ENABLED              (((STM32_USB_ENABLED == TRUE) && \
                                              (STM32_CFG_USB_SEL == RCC_CCIPR1_USB1SEL_ICLKDIV2)))

/**
 * @brief   USB clock derived enable state.
 */
#define STM32_USB_ENABLED                   (((HAL_USE_USB == TRUE) &&      \
                                              (STM32_USB_USE_USB1 == TRUE)))

/**
 * @brief   SDMMC1 clock derived enable state.
 */
#define STM32_SDMMC1_ENABLED                (((HAL_USE_SDC == TRUE) &&      \
                                              (STM32_SDC_USE_SDMMC1 == TRUE)))

/**
 * @brief   I2C1 clock derived enable state.
 */
#define STM32_I2C1_ENABLED                  (((HAL_USE_I2C == TRUE) &&      \
                                              (STM32_I2C_USE_I2C1 == TRUE)))

/**
 * @brief   I2C2 clock derived enable state.
 */
#define STM32_I2C2_ENABLED                  (((HAL_USE_I2C == TRUE) &&      \
                                              (STM32_I2C_USE_I2C2 == TRUE)))

/**
 * @brief   I2C3 clock derived enable state.
 */
#define STM32_I2C3_ENABLED                  (((HAL_USE_I2C == TRUE) &&      \
                                              (STM32_I2C_USE_I2C3 == TRUE)))

/**
 * @brief   I3C1 clock derived enable state.
 */
#define STM32_I3C1_ENABLED                  ((STM32_CFG_I3C1_REQUIRED == TRUE))

/**
 * @brief   I3C2 clock derived enable state.
 */
#define STM32_I3C2_ENABLED                  ((STM32_CFG_I3C2_REQUIRED == TRUE))

/**
 * @brief   ADCDACICLK clock derived enable state.
 */
#define STM32_ADCDACICLK_ENABLED            ((STM32_ADCDACPRE_ENABLED == TRUE))

/**
 * @brief   ADCDACPRE clock derived enable state.
 */
#define STM32_ADCDACPRE_ENABLED             ((STM32_ADCDAC_ENABLED == TRUE))

/**
 * @brief   ADCDAC clock derived enable state.
 */
#define STM32_ADCDAC_ENABLED                (((HAL_USE_ADC == TRUE) &&      \
                                              ((STM32_ADC_USE_ADC1 == TRUE) || \
                                               (STM32_ADC_USE_ADC2 == TRUE))) || \
                                             ((HAL_USE_DAC == TRUE) &&      \
                                              ((STM32_DAC_USE_DAC1_CH1 == TRUE) || \
                                               (STM32_DAC_USE_DAC1_CH2 == TRUE))))

/**
 * @brief   DAC1SH clock derived enable state.
 */
#define STM32_DAC1SH_ENABLED                ((STM32_CFG_DAC1SH_REQUIRED == TRUE))

/**
 * @brief   RNG clock derived enable state.
 */
#define STM32_RNG_ENABLED                   (((HAL_USE_TRNG == TRUE) &&     \
                                              (STM32_TRNG_USE_RNG1 == TRUE)))

/**
 * @brief   FDCAN1 clock derived enable state.
 */
#define STM32_FDCAN1_ENABLED                (((HAL_USE_CAN == TRUE) &&      \
                                              (STM32_CAN_USE_FDCAN1 == TRUE)))

/**
 * @brief   SAI1 clock derived enable state.
 */
#define STM32_SAI1_ENABLED                  ((STM32_CFG_SAI1_REQUIRED == TRUE) || \
                                             ((STM32_ADF1_ENABLED == TRUE) && \
                                              (STM32_CFG_ADF1_SEL == RCC_CCIPR2_ADF1SEL_SAI1)))

/**
 * @brief   ADF1 clock derived enable state.
 */
#define STM32_ADF1_ENABLED                  ((STM32_CFG_ADF1_REQUIRED == TRUE))

/*--- Macros and checks for the NONE clock point. --------------------------*/

/**
 * @brief   NONE nominal source frequency.
 */
#define STM32_NONE_SOURCE_FREQ              0U

