qmk/ChibiOS/os/hal/ports/STM32/STM32U3xx_TEST/clocktree.h
/*--- Macros and checks for the SPI2 clock point. --------------------------*/

/**
 * @brief   SPI2 clock register bits.
 */
#if (STM32_CFG_SPI2_SEL == RCC_CCIPR1_SPI2SEL_PCLK1) || defined(__DOXYGEN__)
  #if (STM32_SPI2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SPI2_BITS                 RCC_CCIPR1_SPI2SEL_PCLK1
  #else
    #define STM32_SPI2_BITS                 0U
  #endif
#elif (STM32_CFG_SPI2_SEL == RCC_CCIPR1_SPI2SEL_MSIK)
  #if (STM32_SPI2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SPI2_BITS                 RCC_CCIPR1_SPI2SEL_MSIK
  #else
    #define STM32_SPI2_BITS                 0U
  #endif
#else
  #error "invalid STM32_CFG_SPI2_SEL value specified"
#endif

/**
 * @brief   SPI2 clock clock point.
 */
#if ((STM32_SPI2_ENABLED == TRUE) && \
     (STM32_CFG_SPI2_SEL == RCC_CCIPR1_SPI2SEL_PCLK1)) || \
    defined(__DOXYGEN__)
  #define STM32_SPI2_FREQ                   STM32_PCLK1_FREQ
#elif (STM32_SPI2_ENABLED == TRUE) && \
      (STM32_CFG_SPI2_SEL == RCC_CCIPR1_SPI2SEL_MSIK)
  #define STM32_SPI2_FREQ                   STM32_MSIK_FREQ
#else
  #define STM32_SPI2_FREQ                   0U
#endif

/*--- Macros and checks for the SPI3 clock point. --------------------------*/

/**
 * @brief   SPI3 clock register bits.
 */
#if (STM32_CFG_SPI3_SEL == RCC_CCIPR2_SPI3SEL_PCLK1) || defined(__DOXYGEN__)
  #if (STM32_SPI3_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SPI3_BITS                 RCC_CCIPR2_SPI3SEL_PCLK1
  #else
    #define STM32_SPI3_BITS                 0U
  #endif
#elif (STM32_CFG_SPI3_SEL == RCC_CCIPR2_SPI3SEL_MSIK)
  #if (STM32_SPI3_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SPI3_BITS                 RCC_CCIPR2_SPI3SEL_MSIK
  #else
    #define STM32_SPI3_BITS                 0U
  #endif
#else
  #error "invalid STM32_CFG_SPI3_SEL value specified"
#endif

/**
 * @brief   SPI3 clock clock point.
 */
#if ((STM32_SPI3_ENABLED == TRUE) && \
     (STM32_CFG_SPI3_SEL == RCC_CCIPR2_SPI3SEL_PCLK1)) || \
    defined(__DOXYGEN__)
  #define STM32_SPI3_FREQ                   STM32_PCLK1_FREQ
#elif (STM32_SPI3_ENABLED == TRUE) && \
      (STM32_CFG_SPI3_SEL == RCC_CCIPR2_SPI3SEL_MSIK)
  #define STM32_SPI3_FREQ                   STM32_MSIK_FREQ
#else
  #define STM32_SPI3_FREQ                   0U
#endif

/*--- Macros and checks for the OCTOSPI clock point. -----------------------*/

/**
 * @brief   OCTOSPI clock register bits.
 */
#if (STM32_CFG_OCTOSPI_SEL == RCC_CCIPR2_OCTOSPISEL_SYSCLK) ||              \
    defined(__DOXYGEN__)
  #if (STM32_OCTOSPI_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_OCTOSPI_BITS              RCC_CCIPR2_OCTOSPISEL_SYSCLK
  #else
    #define STM32_OCTOSPI_BITS              0U
  #endif
#elif (STM32_CFG_OCTOSPI_SEL == RCC_CCIPR2_OCTOSPISEL_MSIK)
  #if (STM32_OCTOSPI_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_OCTOSPI_BITS              RCC_CCIPR2_OCTOSPISEL_MSIK
  #else
    #define STM32_OCTOSPI_BITS              0U
  #endif
#else
  #error "invalid STM32_CFG_OCTOSPI_SEL value specified"
#endif

/**
 * @brief   OCTOSPI clock clock point.
 */
#if ((STM32_OCTOSPI_ENABLED == TRUE) && \
     (STM32_CFG_OCTOSPI_SEL == RCC_CCIPR2_OCTOSPISEL_SYSCLK)) || \
    defined(__DOXYGEN__)
  #define STM32_OCTOSPI_FREQ                STM32_SYSCLK_FREQ
#elif (STM32_OCTOSPI_ENABLED == TRUE) && \
      (STM32_CFG_OCTOSPI_SEL == RCC_CCIPR2_OCTOSPISEL_MSIK)
  #define STM32_OCTOSPI_FREQ                STM32_MSIK_FREQ
#else
  #define STM32_OCTOSPI_FREQ                0U
#endif

/*--- Macros and checks for the SYSTICK clock point. -----------------------*/

/**
 * @brief   SYSTICK clock register bits.
 */
#if (STM32_CFG_SYSTICK_SEL == RCC_CCIPR1_SYSTICKSEL_HCLKDIV8) ||            \
    defined(__DOXYGEN__)
  #define STM32_SYSTICK_BITS                RCC_CCIPR1_SYSTICKSEL_HCLKDIV8
#elif (STM32_CFG_SYSTICK_SEL == RCC_CCIPR1_SYSTICKSEL_LSI)
  #define STM32_SYSTICK_BITS                RCC_CCIPR1_SYSTICKSEL_LSI
#elif (STM32_CFG_SYSTICK_SEL == RCC_CCIPR1_SYSTICKSEL_LSE)
  #define STM32_SYSTICK_BITS                RCC_CCIPR1_SYSTICKSEL_LSE
#else
  #error "invalid STM32_CFG_SYSTICK_SEL value specified"
#endif

/**
 * @brief   SYSTICK clock clock point.
 */
#if ((STM32_SYSTICK_ENABLED == TRUE) && \
     (STM32_CFG_SYSTICK_SEL == RCC_CCIPR1_SYSTICKSEL_HCLKDIV8)) || \
    defined(__DOXYGEN__)
  #define STM32_SYSTICK_FREQ                STM32_HCLKDIV8_FREQ
#elif (STM32_SYSTICK_ENABLED == TRUE) && \
      (STM32_CFG_SYSTICK_SEL == RCC_CCIPR1_SYSTICKSEL_LSI)
  #define STM32_SYSTICK_FREQ                STM32_LSI_FREQ
#elif (STM32_SYSTICK_ENABLED == TRUE) && \
      (STM32_CFG_SYSTICK_SEL == RCC_CCIPR1_SYSTICKSEL_LSE)
  #define STM32_SYSTICK_FREQ                STM32_LSE_FREQ
#else
  #define STM32_SYSTICK_FREQ                0U
#endif

/*--- Macros and checks for the TIM16IC clock point. -----------------------*/

/**
 * @brief   TIM16IC clock register bits.
 */
#define STM32_TIM16IC_BITS                  0U

/**
 * @brief   TIM16 internal capture clock clock point.
 */
#if (STM32_TIM16IC_ENABLED == FALSE) && !defined(__DOXYGEN__)
  #define STM32_TIM16IC_FREQ                0U
#elif (STM32_CFG_TIMICSEL == RCC_CCIPR1_TIMICSEL_NOCLOCK) || \
    defined(__DOXYGEN__)
  #define STM32_TIM16IC_FREQ                0U
#else
  #define STM32_TIM16IC_FREQ                (hal_lld_get_clock_point(CLK_HSI16) / \
                                             256U)
#endif

/*--- Macros and checks for the TIM17IC clock point. -----------------------*/

/**
 * @brief   TIM17IC clock register bits.
 */
#define STM32_TIM17IC_BITS                  0U

/**
 * @brief   TIM17 internal capture clock clock point.
 */
#if (STM32_TIM17IC_ENABLED == FALSE) && !defined(__DOXYGEN__)
  #define STM32_TIM17IC_FREQ                0U
#elif (STM32_CFG_TIMICSEL == RCC_CCIPR1_TIMICSEL_NOCLOCK) || \
    defined(__DOXYGEN__)
  #define STM32_TIM17IC_FREQ                0U
#elif ((STM32_CFG_TIMICSEL == RCC_CCIPR1_TIMICSEL_HSI256_MSIS1024_MSIS4) || (STM32_CFG_TIMICSEL == RCC_CCIPR1_TIMICSEL_HSI256_MSIS1024_MSIK4))
  #define STM32_TIM17IC_FREQ                (hal_lld_get_clock_point(CLK_MSIS) / \
                                             1024U)
#else
  #define STM32_TIM17IC_FREQ                (hal_lld_get_clock_point(CLK_MSIK) / \
                                             1024U)
#endif

/*--- Macros and checks for the LPTIM2IC clock point. ----------------------*/

/**
 * @brief   LPTIM2IC clock register bits.
 */
#define STM32_LPTIM2IC_BITS                 0U

/**
 * @brief   LPTIM2 internal capture clock clock point.
 */
#if (STM32_LPTIM2IC_ENABLED == FALSE) && !defined(__DOXYGEN__)
  #define STM32_LPTIM2IC_FREQ               0U
#elif (STM32_CFG_TIMICSEL == RCC_CCIPR1_TIMICSEL_NOCLOCK) || \
    defined(__DOXYGEN__)
  #define STM32_LPTIM2IC_FREQ               0U
#elif ((STM32_CFG_TIMICSEL == RCC_CCIPR1_TIMICSEL_HSI256_MSIS1024_MSIS4) || (STM32_CFG_TIMICSEL == RCC_CCIPR1_TIMICSEL_HSI256_MSIK1024_MSIS4))
  #define STM32_LPTIM2IC_FREQ               (hal_lld_get_clock_point(CLK_MSIS) / \
                                             4U)
#else
  #define STM32_LPTIM2IC_FREQ               (hal_lld_get_clock_point(CLK_MSIK) / \
                                             4U)
#endif

/*--- Macros and checks for the ICLK clock point. --------------------------*/

/**
 * @brief   ICLK clock register bits.
 */
#if (STM32_CFG_ICLK_SEL == RCC_CCIPR1_ICLKSEL_HSI48) || defined(__DOXYGEN__)
  #if (STM32_ICLK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ICLK_BITS                 RCC_CCIPR1_ICLKSEL_HSI48
  #else
    #define STM32_ICLK_BITS                 0U
  #endif
#elif (STM32_CFG_ICLK_SEL == RCC_CCIPR1_ICLKSEL_MSIK)
  #if (STM32_ICLK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ICLK_BITS                 RCC_CCIPR1_ICLKSEL_MSIK
  #else
    #define STM32_ICLK_BITS                 0U
  #endif
#elif (STM32_CFG_ICLK_SEL == RCC_CCIPR1_ICLKSEL_HSE)
  #if (STM32_ICLK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ICLK_BITS                 RCC_CCIPR1_ICLKSEL_HSE
  #else
    #define STM32_ICLK_BITS                 0U
  #endif
#elif (STM32_CFG_ICLK_SEL == RCC_CCIPR1_ICLKSEL_SYSCLK)
  #if (STM32_ICLK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ICLK_BITS                 RCC_CCIPR1_ICLKSEL_SYSCLK
  #else
    #define STM32_ICLK_BITS                 0U
  #endif
#else
  #error "invalid STM32_CFG_ICLK_SEL value specified"
#endif

/**
 * @brief   ICLK clock clock point.
 */
#if ((STM32_ICLK_ENABLED == TRUE) && \
     (STM32_CFG_ICLK_SEL == RCC_CCIPR1_ICLKSEL_HSI48)) || \
    defined(__DOXYGEN__)
  #define STM32_ICLK_FREQ                   STM32_HSI48_FREQ
#elif (STM32_ICLK_ENABLED == TRUE) && \
      (STM32_CFG_ICLK_SEL == RCC_CCIPR1_ICLKSEL_MSIK)
  #define STM32_ICLK_FREQ                   STM32_MSIK_FREQ
#elif (STM32_ICLK_ENABLED == TRUE) && \
      (STM32_CFG_ICLK_SEL == RCC_CCIPR1_ICLKSEL_HSE)
  #define STM32_ICLK_FREQ                   STM32_HSE_FREQ
#elif (STM32_ICLK_ENABLED == TRUE) && \
      (STM32_CFG_ICLK_SEL == RCC_CCIPR1_ICLKSEL_SYSCLK)
  #define STM32_ICLK_FREQ                   STM32_SYSCLK_FREQ
#else
  #define STM32_ICLK_FREQ                   0U
#endif

/*--- Macros and checks for the ICLKDIV2 clock point. ----------------------*/

/**
 * @brief   ICLKDIV2 clock register bits.
 */
#define STM32_ICLKDIV2_BITS                 0U

/**
 * @brief   ICLK divided by 2 clock point.
 */
#if (STM32_ICLKDIV2_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_ICLKDIV2_FREQ               (STM32_ICLK_FREQ / 2U)
#else
  #define STM32_ICLKDIV2_FREQ               0U
#endif

/*--- Macros and checks for the USB clock point. ---------------------------*/

/**
 * @brief   USB clock register bits.
 */
#if (STM32_CFG_USB_SEL == RCC_CCIPR1_USB1SEL_ICLK) || defined(__DOXYGEN__)
  #if (STM32_USB_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_USB_BITS                  RCC_CCIPR1_USB1SEL_ICLK
  #else
    #define STM32_USB_BITS                  0U
  #endif
#elif (STM32_CFG_USB_SEL == RCC_CCIPR1_USB1SEL_ICLKDIV2)
  #if (STM32_USB_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_USB_BITS                  RCC_CCIPR1_USB1SEL_ICLKDIV2
  #else
    #define STM32_USB_BITS                  0U
  #endif
#else
  #error "invalid STM32_CFG_USB_SEL value specified"
#endif

/**
 * @brief   USB clock clock point.
 */
#if ((STM32_USB_ENABLED == TRUE) && \
     (STM32_CFG_USB_SEL == RCC_CCIPR1_USB1SEL_ICLK)) || \
    defined(__DOXYGEN__)
  #define STM32_USB_FREQ                    STM32_ICLK_FREQ
#elif (STM32_USB_ENABLED == TRUE) && \
      (STM32_CFG_USB_SEL == RCC_CCIPR1_USB1SEL_ICLKDIV2)
  #define STM32_USB_FREQ                    STM32_ICLKDIV2_FREQ
#else
  #define STM32_USB_FREQ                    0U
#endif

/*--- Macros and checks for the SDMMC1 clock point. ------------------------*/

/**
 * @brief   SDMMC1 clock register bits.
 */
#define STM32_SDMMC1_BITS                   0U

/**
 * @brief   SDMMC1 clock clock point.
 */
#if (STM32_SDMMC1_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_SDMMC1_FREQ                 STM32_ICLK_FREQ
#else
  #define STM32_SDMMC1_FREQ                 0U
#endif

/*--- Macros and checks for the I2C1 clock point. --------------------------*/

/**
 * @brief   I2C1 clock register bits.
 */
#if (STM32_CFG_I2C1_SEL == RCC_CCIPR1_I2C1SEL_PCLK1) || defined(__DOXYGEN__)
  #if (STM32_I2C1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_I2C1_BITS                 RCC_CCIPR1_I2C1SEL_PCLK1
  #else
    #define STM32_I2C1_BITS                 0U
  #endif
#elif (STM32_CFG_I2C1_SEL == RCC_CCIPR1_I2C1SEL_MSIK)
  #if (STM32_I2C1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_I2C1_BITS                 RCC_CCIPR1_I2C1SEL_MSIK
  #else
    #define STM32_I2C1_BITS                 0U
  #endif
#else
  #error "invalid STM32_CFG_I2C1_SEL value specified"
#endif

/**
 * @brief   I2C1 clock clock point.
 */
#if ((STM32_I2C1_ENABLED == TRUE) && \
     (STM32_CFG_I2C1_SEL == RCC_CCIPR1_I2C1SEL_PCLK1)) || \
    defined(__DOXYGEN__)
  #define STM32_I2C1_FREQ                   STM32_PCLK1_FREQ
#elif (STM32_I2C1_ENABLED == TRUE) && \
      (STM32_CFG_I2C1_SEL == RCC_CCIPR1_I2C1SEL_MSIK)
  #define STM32_I2C1_FREQ                   STM32_MSIK_FREQ
#else
  #define STM32_I2C1_FREQ                   0U
#endif

