qmk/ChibiOS/os/hal/ports/STM32/STM32U3xx_TEST/clocktree.h
#if !((STM32_ADCDAC_ENABLED != TRUE) ||                                     \
     (STM32_ADCDAC_FREQ <= STM32_ADCCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_ADCDAC_FREQ above maximum frequency"
#endif

/*--- Macros and checks for the DAC1SH clock point. ------------------------*/

/**
 * @brief   DAC1SH clock register bits.
 */
#if (STM32_CFG_DAC1SH_SEL == RCC_CCIPR2_DAC1SHSEL_LSE) || defined(__DOXYGEN__)
  #if (STM32_DAC1SH_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_DAC1SH_BITS               RCC_CCIPR2_DAC1SHSEL_LSE
  #else
    #define STM32_DAC1SH_BITS               0U
  #endif
#elif (STM32_CFG_DAC1SH_SEL == RCC_CCIPR2_DAC1SHSEL_LSI)
  #if (STM32_DAC1SH_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_DAC1SH_BITS               RCC_CCIPR2_DAC1SHSEL_LSI
  #else
    #define STM32_DAC1SH_BITS               0U
  #endif
#elif (STM32_DAC1SH_ENABLED == FALSE) &&                                    \
      (STM32_CFG_DAC1SH_SEL == RCC_CCIPR2_DAC1SHSEL_IGNORE)
  #define STM32_DAC1SH_BITS                 0U
#else
  #error "invalid STM32_CFG_DAC1SH_SEL value specified"
#endif

/**
 * @brief   DAC1 sample and hold clock clock point.
 */
#if ((STM32_DAC1SH_ENABLED == TRUE) && \
     (STM32_CFG_DAC1SH_SEL == RCC_CCIPR2_DAC1SHSEL_LSE)) || \
    defined(__DOXYGEN__)
  #define STM32_DAC1SH_FREQ                 STM32_LSE_FREQ
#elif (STM32_DAC1SH_ENABLED == TRUE) && \
      (STM32_CFG_DAC1SH_SEL == RCC_CCIPR2_DAC1SHSEL_LSI)
  #define STM32_DAC1SH_FREQ                 STM32_LSI_FREQ
#else
  #define STM32_DAC1SH_FREQ                 0U
#endif

/*--- Macros and checks for the RNG clock point. ---------------------------*/

/**
 * @brief   RNG clock register bits.
 */
#if (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_HSI48) || defined(__DOXYGEN__)
  #if (STM32_RNG_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_RNG_BITS                  RCC_CCIPR2_RNGSEL_HSI48
  #else
    #define STM32_RNG_BITS                  0U
  #endif
#elif (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_MSIK)
  #if (STM32_RNG_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_RNG_BITS                  RCC_CCIPR2_RNGSEL_MSIK
  #else
    #define STM32_RNG_BITS                  0U
  #endif
#elif (STM32_RNG_ENABLED == FALSE) &&                                       \
      (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_IGNORE)
  #define STM32_RNG_BITS                    0U
#else
  #error "invalid STM32_CFG_RNG_SEL value specified"
#endif

/**
 * @brief   RNG clock clock point.
 */
#if ((STM32_RNG_ENABLED == TRUE) && \
     (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_HSI48)) || \
    defined(__DOXYGEN__)
  #define STM32_RNG_FREQ                    STM32_HSI48_FREQ
#elif (STM32_RNG_ENABLED == TRUE) && \
      (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_MSIK)
  #define STM32_RNG_FREQ                    STM32_MSIK_FREQ
#else
  #define STM32_RNG_FREQ                    0U
#endif

/*--- Macros and checks for the FDCAN1 clock point. ------------------------*/

/**
 * @brief   FDCAN1 clock register bits.
 */
#if (STM32_CFG_FDCAN1_SEL == RCC_CCIPR1_FDCAN1SEL_SYSCLK) ||                \
    defined(__DOXYGEN__)
  #if (STM32_FDCAN1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_FDCAN1_BITS               RCC_CCIPR1_FDCAN1SEL_SYSCLK
  #else
    #define STM32_FDCAN1_BITS               0U
  #endif
#elif (STM32_CFG_FDCAN1_SEL == RCC_CCIPR1_FDCAN1SEL_MSIK)
  #if (STM32_FDCAN1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_FDCAN1_BITS               RCC_CCIPR1_FDCAN1SEL_MSIK
  #else
    #define STM32_FDCAN1_BITS               0U
  #endif
#elif (STM32_FDCAN1_ENABLED == FALSE) &&                                    \
      (STM32_CFG_FDCAN1_SEL == RCC_CCIPR1_FDCAN1SEL_IGNORE)
  #define STM32_FDCAN1_BITS                 0U
#else
  #error "invalid STM32_CFG_FDCAN1_SEL value specified"
#endif

/**
 * @brief   FDCAN1 clock clock point.
 */
#if ((STM32_FDCAN1_ENABLED == TRUE) && \
     (STM32_CFG_FDCAN1_SEL == RCC_CCIPR1_FDCAN1SEL_SYSCLK)) || \
    defined(__DOXYGEN__)
  #define STM32_FDCAN1_FREQ                 STM32_SYSCLK_FREQ
#elif (STM32_FDCAN1_ENABLED == TRUE) && \
      (STM32_CFG_FDCAN1_SEL == RCC_CCIPR1_FDCAN1SEL_MSIK)
  #define STM32_FDCAN1_FREQ                 STM32_MSIK_FREQ
#else
  #define STM32_FDCAN1_FREQ                 0U
#endif

/*--- Macros and checks for the SAI1 clock point. --------------------------*/

/**
 * @brief   SAI1 clock register bits.
 */
#if (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_MSIK) || defined(__DOXYGEN__)
  #if (STM32_SAI1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SAI1_BITS                 RCC_CCIPR2_SAI1SEL_MSIK
  #else
    #define STM32_SAI1_BITS                 0U
  #endif
#elif (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_AUDIOCLK)
  #if (STM32_SAI1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SAI1_BITS                 RCC_CCIPR2_SAI1SEL_AUDIOCLK
  #else
    #define STM32_SAI1_BITS                 0U
  #endif
#elif (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_HSE)
  #if (STM32_SAI1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SAI1_BITS                 RCC_CCIPR2_SAI1SEL_HSE
  #else
    #define STM32_SAI1_BITS                 0U
  #endif
#else
  #error "invalid STM32_CFG_SAI1_SEL value specified"
#endif

/**
 * @brief   SAI1 clock clock point.
 */
#if ((STM32_SAI1_ENABLED == TRUE) && \
     (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_MSIK)) || \
    defined(__DOXYGEN__)
  #define STM32_SAI1_FREQ                   STM32_MSIK_FREQ
#elif (STM32_SAI1_ENABLED == TRUE) && \
      (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_AUDIOCLK)
  #define STM32_SAI1_FREQ                   STM32_AUDIOCLK_FREQ
#elif (STM32_SAI1_ENABLED == TRUE) && \
      (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_HSE)
  #define STM32_SAI1_FREQ                   STM32_HSE_FREQ
#else
  #define STM32_SAI1_FREQ                   0U
#endif

/*--- Macros and checks for the ADF1 clock point. --------------------------*/

/**
 * @brief   ADF1 clock register bits.
 */
#if (STM32_CFG_ADF1_SEL == RCC_CCIPR2_ADF1SEL_HCLK) || defined(__DOXYGEN__)
  #if (STM32_ADF1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADF1_BITS                 RCC_CCIPR2_ADF1SEL_HCLK
  #else
    #define STM32_ADF1_BITS                 0U
  #endif
#elif (STM32_CFG_ADF1_SEL == RCC_CCIPR2_ADF1SEL_AUDIOCLK)
  #if (STM32_ADF1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADF1_BITS                 RCC_CCIPR2_ADF1SEL_AUDIOCLK
  #else
    #define STM32_ADF1_BITS                 0U
  #endif
#elif (STM32_CFG_ADF1_SEL == RCC_CCIPR2_ADF1SEL_HSE)
  #if (STM32_ADF1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADF1_BITS                 RCC_CCIPR2_ADF1SEL_HSE
  #else
    #define STM32_ADF1_BITS                 0U
  #endif
#elif (STM32_CFG_ADF1_SEL == RCC_CCIPR2_ADF1SEL_SAI1)
  #if (STM32_ADF1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADF1_BITS                 RCC_CCIPR2_ADF1SEL_SAI1
  #else
    #define STM32_ADF1_BITS                 0U
  #endif
#else
  #error "invalid STM32_CFG_ADF1_SEL value specified"
#endif

/**
 * @brief   ADF1 clock clock point.
 */
#if ((STM32_ADF1_ENABLED == TRUE) && \
     (STM32_CFG_ADF1_SEL == RCC_CCIPR2_ADF1SEL_HCLK)) || \
    defined(__DOXYGEN__)
  #define STM32_ADF1_FREQ                   STM32_HCLK_FREQ
#elif (STM32_ADF1_ENABLED == TRUE) && \
      (STM32_CFG_ADF1_SEL == RCC_CCIPR2_ADF1SEL_AUDIOCLK)
  #define STM32_ADF1_FREQ                   STM32_AUDIOCLK_FREQ
#elif (STM32_ADF1_ENABLED == TRUE) && \
      (STM32_CFG_ADF1_SEL == RCC_CCIPR2_ADF1SEL_HSE)
  #define STM32_ADF1_FREQ                   STM32_HSE_FREQ
#elif (STM32_ADF1_ENABLED == TRUE) && \
      (STM32_CFG_ADF1_SEL == RCC_CCIPR2_ADF1SEL_SAI1)
  #define STM32_ADF1_FREQ                   STM32_SAI1_FREQ
#else
  #define STM32_ADF1_FREQ                   0U
#endif

